# Задача "Рассылка писем":
# Часто при разработке и работе с рассылками писем(e-mail) они отправляются от одного и того же пользователя(администрации
# или службы поддержки). Тем не менее должна быть возможность сменить его в редких случаях.
# Попробуем реализовать функцию с подробной логикой.
# Создайте функцию send_email, которая принимает 2 обычных аргумента: сообщение и получатель и 1 обязательно именованный
# аргумент со значением по умолчанию - отправитель.
# Внутри функции реализовать следующую логику:
# Проверка на корректность e-mail отправителя и получателя.
# Проверка на отправку самому себе.
# Проверка на отправителя по умолчанию.
#
# Пункты задачи:
# Создайте функцию send_email, которая принимает 2 обычных аргумента: message(сообщение), recipient(получатель)
# и 1 обязательно именованный аргумент со значением по умолчанию sender = "university.help@gmail.com".
# Если строки recipient и sender не содержит "@" или не оканчивается на ".com"/".ru"/".net", то вывести на экран(в консоль)
# строку: "Невозможно отправить письмо с адреса <sender> на адрес <recipient>".
# Если же sender и recipient совпадают, то вывести "Нельзя отправить письмо самому себе!"
# Если же отправитель по умолчанию - university.help@gmail.com, то вывести сообщение: "Письмо успешно отправлено
# с адреса <sender> на адрес <recipient>."
# В противном случае вывести сообщение: "НЕСТАНДАРТНЫЙ ОТПРАВИТЕЛЬ! Письмо отправлено с адреса <sender> на адрес <recipient>."
# Здесь <sender> и <recipient> - значения хранящиеся в этих переменных.
# За один вызов функции выводится только одно и перечисленных уведомлений! Проверки перечислены по мере выполнения.

def send_email(сообщение, получатель, центр="univer_sity.help@gmail.com"):
    if (("@" and (".com" or ".ru" or ".net")) not in (получатель or центр)
            or ("@" or (".com" or ".ru" or ".net"))
            not in (получатель or центр)):
        print(f"Невозможно отправить письмо с адреса {центр} на адрес {получатель}")  # f- питон ищет переменные {} в строке
    elif получатель == центр:
        print("Нельзя отправить письмо самому себе!")
    elif центр == "univer_sity.help@gmail.com":
        print(f"Письмо успешно отправлено с адреса {центр} на адрес {получатель}.")
    elif центр != "univer_sity.help@gmail.com":
        print(f"НЕСТАНДАРТНЫЙ ОТПРАВИТЕЛЬ! Письмо отправлено с адреса {центр} на адрес {получатель}.")


send_email('mess_1', 'univer_sity@.com')
send_email('mess_2', 'saw@.com' ,'univer_sity@gmail.com')
send_email('mess_3', 'univer@')
send_email('mess_4', 'univer_sity.help@gmail.com')